---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
source: html/446fa3c6-4f35-47f4-e8c2-e5235c321836.htm
---
# Autodesk.Revit.DB.Events.RevitAPISingleEventArgs

The class is used as a base class for arguments of any single-event.

## Syntax (C#)
```csharp
public class RevitAPISingleEventArgs : RevitAPIEventArgs
```

## Remarks
A single event is an event that is not directly related to another event, meaning that there is no corresponding pre-event or post-event surrounding a single event.